﻿//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2019, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************
// @file RsdIscsiConfig.uni
//  To link Rsd Iscsi Page under Advanced page 

/=#

#langdef en-US "English"
#langdef x-UEFI-ns "UefiNameSpace"

//RSD Iscsi Page

#string STR_RSD_ISCSI_FORM_TITLE                #language en-US "RSD iSCSI Configuration"
#string STR_RSD_ISCSI_CONFIG_INIT_NAME          #language en-US "RSD iSCSI Initiator Name"
#string STR_RSD_ISCSI_CONFIG_INIT_NAME_VALUE    #language en-US ""//updated dynamically
#string STR_RSD_ISCSI_ATTEMPT_NAME              #language en-US "RSD iSCSI Attempt Name"
#string STR_RSD_ISCSI_ATTEMPT_NAME_VALUE        #language en-US ""// updated dynamically
#string STR_RSD_ISCSI_CONFIG_RETRY              #language en-US "Connection Retry Count"
#string STR_RSD_ISCSI_CONFIG_RETRY_VALUE        #language en-US "" // updated dynamically
#string STR_RSD_ISCSI_CONFIG_TIMEOUT            #language en-US "Connection Establishing Timeout"
#string STR_RSD_ISCSI_CONFIG_TIMEOUT_VALUE      #language en-US ""//updated dynamically

// To display Initiator and Server IP Mode
#string STR_RSD_ISCSI_INIT_IP_CONFIG            #language en-US "Initiator IP Mode"
#string STR_RSD_ISCSI_INIT_IP_CONFIG_VALUE      #language en-US ""//updated dynamically
#string STR_RSD_ISCSI_SERVER_IP_CONFIG          #language en-US "Server IP Mode"
#string STR_RSD_ISCSI_SERVER_IP_CONFIG_VALUE    #language en-US ""//updated dynamically

#string STR_RSD_ISCSI_MODE                      #language en-US "iSCSI Mode"
#string STR_RSD_ISCSI_MODE_VALUE                #language en-US "" // updated dynamically
#string STR_RSD_IP_MODE                         #language en-US "Internet Protocol"
#string STR_RSD_IP_MODE_VALUE                   #language en-US ""// updated dynamically
#string STR_RSD_ISCSI_LOCAL_IP_ADDRESS          #language en-US "  Initiator IP Address"
#string STR_RSD_ISCSI_LOCAL_IP_ADDRESS_VALUE    #language en-US "" // updated dynamically
#string STR_RSD_DEFAULT_LOCAL_IP                #language en-US " 0.0.0.0"         
#string STR_RSD_ISCSI_LOCAL_MASK                #language en-US "  Initiator Subnet Mask"
#string STR_RSD_ISCSI_LOCAL_MASK_VALUE          #language en-US ""//updated dynamically
#string STR_RSD_ISCSI_LOCAL_GATEWAY             #language en-US "  Initiator Gateway"
#string STR_RSD_ISCSI_LOCAL_GATEWAY_VALUE       #language en-US ""//updated dynamically
#string STR_RSD_ISCSI_TARGET_NAME               #language en-US "Target Name"
#string STR_RSD_ISCSI_TARGET_NAME_VALUE         #language en-US ""// updated dynamically
#string STR_RSD_ISCSI_TARGET_ADDRESS            #language en-US "  Target Address"
#string STR_RSD_ISCSI_TARGET_ADDRESS_VALUE      #language en-US "" // updated dynamically
#string STR_RSD_ISCSI_TARGET_PORT               #language en-US "  Target Port"
#string STR_RSD_ISCSI_TARGET_PORT_VALUE         #language en-US "" //updated dynamically
#string STR_RSD_ISCSI_BOOT_LUN                  #language en-US "Boot LUN"
#string STR_RSD_ISCSI_BOOT_LUN_VALUE            #language en-US ""
#string STR_RSD_ISCSI_CONFIG_ISID               #language en-US "Configure ISID"
#string STR_RSD_ISCSI_CONFIG_ISID_VALUE         #language en-US ""//updated dynamically

#string STR_RSD_AUTHEN_TYPE                     #language en-US "Authentication Type"
#string STR_RSD_AUTHEN_TYPE_VALUE               #language en-US ""//updated dynamically
#string STR_RSD_CHAP_TYPE                       #language en-US "CHAP Type"
#string STR_RSD_CHAP_TYPE_VALUE                 #language en-US ""//updated dynamically
#string STR_RSD_CHAP_SECRET_STATUS              #language en-US "  CHAP Status"
#string STR_RSD_CHAP_SECRET_STATUS_VALUE        #language en-US "Not Installed"//updated dynamically
#string STR_RSD_REVERSE_CHAP_SECRET_STATUS      #language en-US "  Reverse CHAP Status"
#string STR_RSD_REVERSE_CHAP_SECRET_STATUS_VALUE #language en-US " Not Installed" //updated dynamically
